balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6013A.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="C2TX2DLC" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuu---" edc:name="C2TX2DLC" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxx---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DLC" edc:desc="" edc:mask="0xf" edc:name="DLC" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="TXRB0" edc:desc="" edc:mask="0x1" edc:name="TXRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXRB1" edc:desc="" edc:mask="0x1" edc:name="TXRB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0xA"/>
              <edc:SFRFieldDef edc:cname="EID5_0" edc:desc="" edc:mask="0x1" edc:name="EID5_0" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2TX2B1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C2TX2B1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D0" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D0" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB2D1" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB2D00" edc:desc="" edc:mask="0x1" edc:name="TXB2D00" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D01" edc:desc="" edc:mask="0x1" edc:name="TXB2D01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D02" edc:desc="" edc:mask="0x1" edc:name="TXB2D02" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D03" edc:desc="" edc:mask="0x1" edc:name="TXB2D03" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D04" edc:desc="" edc:mask="0x1" edc:name="TXB2D04" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D05" edc:desc="" edc:mask="0x1" edc:name="TXB2D05" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D06" edc:desc="" edc:mask="0x1" edc:name="TXB2D06" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D07" edc:desc="" edc:mask="0x1" edc:name="TXB2D07" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D10" edc:desc="" edc:mask="0x1" edc:name="TXB2D10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D11" edc:desc="" edc:mask="0x1" edc:name="TXB2D11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D12" edc:desc="" edc:mask="0x1" edc:name="TXB2D12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D13" edc:desc="" edc:mask="0x1" edc:name="TXB2D13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D14" edc:desc="" edc:mask="0x1" edc:name="TXB2D14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D15" edc:desc="" edc:mask="0x1" edc:name="TXB2D15" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D16" edc:desc="" edc:mask="0x1" edc:name="TXB2D16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D17" edc:desc="" edc:mask="0x1" edc:name="TXB2D17" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2TX2B2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C2TX2B2" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D2" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB2D3" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB2D20" edc:desc="" edc:mask="0x1" edc:name="TXB2D20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D21" edc:desc="" edc:mask="0x1" edc:name="TXB2D21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D22" edc:desc="" edc:mask="0x1" edc:name="TXB2D22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D23" edc:desc="" edc:mask="0x1" edc:name="TXB2D23" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D24" edc:desc="" edc:mask="0x1" edc:name="TXB2D24" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D25" edc:desc="" edc:mask="0x1" edc:name="TXB2D25" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D26" edc:desc="" edc:mask="0x1" edc:name="TXB2D26" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D27" edc:desc="" edc:mask="0x1" edc:name="TXB2D27" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D30" edc:desc="" edc:mask="0x1" edc:name="TXB2D30" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D31" edc:desc="" edc:mask="0x1" edc:name="TXB2D31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D32" edc:desc="" edc:mask="0x1" edc:name="TXB2D32" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D33" edc:desc="" edc:mask="0x1" edc:name="TXB2D33" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D34" edc:desc="" edc:mask="0x1" edc:name="TXB2D34" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D35" edc:desc="" edc:mask="0x1" edc:name="TXB2D35" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D36" edc:desc="" edc:mask="0x1" edc:name="TXB2D36" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D37" edc:desc="" edc:mask="0x1" edc:name="TXB2D37" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2TX2B3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C2TX2B3" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D4" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D4" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB2D5" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D5" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB2D40" edc:desc="" edc:mask="0x1" edc:name="TXB2D40" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D41" edc:desc="" edc:mask="0x1" edc:name="TXB2D41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D42" edc:desc="" edc:mask="0x1" edc:name="TXB2D42" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D43" edc:desc="" edc:mask="0x1" edc:name="TXB2D43" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D44" edc:desc="" edc:mask="0x1" edc:name="TXB2D44" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D45" edc:desc="" edc:mask="0x1" edc:name="TXB2D45" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D46" edc:desc="" edc:mask="0x1" edc:name="TXB2D46" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D47" edc:desc="" edc:mask="0x1" edc:name="TXB2D47" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D50" edc:desc="" edc:mask="0x1" edc:name="TXB2D50" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D51" edc:desc="" edc:mask="0x1" edc:name="TXB2D51" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D52" edc:desc="" edc:mask="0x1" edc:name="TXB2D52" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D53" edc:desc="" edc:mask="0x1" edc:name="TXB2D53" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D54" edc:desc="" edc:mask="0x1" edc:name="TXB2D54" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D55" edc:desc="" edc:mask="0x1" edc:name="TXB2D55" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D56" edc:desc="" edc:mask="0x1" edc:name="TXB2D56" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D57" edc:desc="" edc:mask="0x1" edc:name="TXB2D57" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="C2TX2B4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="C2TX2B4" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB2D6" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D6" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TXB2D7" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TXB2D7" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB2D60" edc:desc="" edc:mask="0x1" edc:name="TXB2D60" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D61" edc:desc="" edc:mask="0x1" edc:name="TXB2D61" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D62" edc:desc="" edc:mask="0x1" edc:name="TXB2D62" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D63" edc:desc="" edc:mask="0x1" edc:name="TXB2D63" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D64" edc:desc="" edc:mask="0x1" edc:name="TXB2D64" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D65" edc:desc="" edc:mask="0x1" edc:name="TXB2D65" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D66" edc:desc="" edc:mask="0x1" edc:name="TXB2D66" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D67" edc:desc="" edc:mask="0x1" edc:name="TXB2D67" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D70" edc:desc="" edc:mask="0x1" edc:name="TXB2D70" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D71" edc:desc="" edc:mask="0x1" edc:name="TXB2D71" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D72" edc:desc="" edc:mask="0x1" edc:name="TXB2D72" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D73" edc:desc="" edc:mask="0x1" edc:name="TXB2D73" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D74" edc:desc="" edc:mask="0x1" edc:name="TXB2D74" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D75" edc:desc="" edc:mask="0x1" edc:name="TXB2D75" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D76" edc:desc="" edc:mask="0x1" edc:name="TXB2D76" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB2D77" edc:desc="" edc:mask="0x1" edc:name="TXB2D77" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
